[
  
  
  {
    "section": "Section 420",
    "title": "Cheating and dishonestly inducing delivery of property",
    "content": "Whoever cheats and thereby dishonestly induces the person deceived to deliver any property to any person, shall be punished with imprisonment of either description for a term which may extend to seven years and shall also be liable to fine."
  },
  
  {
    "section": "Section 124A",
    "title": "Sedition",
    "content": "Whoever by words, either spoken or written, or by signs, or by visible representation, or otherwise, brings or attempts to bring into hatred or contempt, or excites or attempts to excite disaffection towards the Government shall be punished with imprisonment for life."
  },
  {
    "section": "Section 498A",
    "title": "Cruelty by husband or relatives of husband",
    "content": "Whoever, being the husband or the relative of the husband of a woman, subjects her to cruelty shall be punished with imprisonment up to three years and shall also be liable to fine."
  },
  {
    "section": "Section 326",
    "title": "Voluntarily causing grievous hurt by dangerous weapons or means",
    "content": "Whoever voluntarily causes grievous hurt by means of any instrument for shooting, stabbing, or cutting, or any other means which are likely to cause death, shall be punished with imprisonment for a term which may extend to ten years and shall also be liable to fine."
  },
  
  {
    "section": "Section 376",
    "title": "Punishment for rape",
    "content": "Whoever, commits rape shall be punished with rigorous imprisonment of not less than ten years, but which may extend to life, and shall also be liable to fine."
  },
  {
    "section": "Section 141",
    "title": "Unlawful assembly",
    "content": "An assembly of five or more persons is designated an 'unlawful assembly' if the common object is to overawe the Government, resist execution of law, commit mischief or trespass, or forcefully obtain possession of property."
  },
  {
    "section": "Section 12",
    "title": "Definition of Public",
    "content": "The word ‘public’ includes any class of the public or any community."
  },
  {
    "section": "Section 21",
    "title": "Public Servant",
    "content": "The term 'public servant' denotes a person falling under any of the descriptions given in this section."
  },
  {
    "section": "Section 24",
    "title": "Dishonestly",
    "content": "Whoever does anything with the intention of causing wrongful gain to one person or wrongful loss to another person, is said to do that thing dishonestly."
  },
  {
    "section": "Section 34",
    "title": "Acts done by several persons in furtherance of common intention",
    "content": "When a criminal act is done by several persons in furtherance of the common intention of all, each of such persons is liable for that act."
  },
  {
    "section": "Section 120B",
    "title": "Punishment of criminal conspiracy",
    "content": "Whoever is a party to a criminal conspiracy to commit an offence punishable with death, imprisonment for life, or rigorous imprisonment for a term of two years or upwards shall, where no express provision is made in this Code for the punishment of such a conspiracy, be punished in the same manner as if he had abetted such offence."
  },
  {
    "section": "Section 302",
    "title": "Punishment for murder",
    "content": "Whoever commits murder shall be punished with death, or imprisonment for life, and shall also be liable to fine."
  },
  {
    "section": "Section 307",
    "title": "Attempt to murder",
    "content": "Whoever does any act with such intention or knowledge, and under such circumstances that, if he by that act caused death, he would be guilty of murder, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine."
  },
  {
    "section": "Section 354",
    "title": "Assault or criminal force to woman with intent to outrage her modesty",
    "content": "Whoever assaults or uses criminal force to any woman, intending to outrage or knowing it to be likely that he will thereby outrage her modesty, shall be punished with imprisonment of either description for a term which shall not be less than one year but which may extend to five years, and shall also be liable to fine."
  },
  {
    "section": "Section 375",
    "title": "Rape",
    "content": "A man is said to commit rape if he does any of the following acts: (a) penetration without consent, (b) against her will, (c) by coercion, etc., under the conditions defined in the section."
  },
  {
    "section": "Section 420",
    "title": "Cheating and dishonestly inducing delivery of property",
    "content": "Whoever cheats and thereby dishonestly induces the person deceived to deliver any property to any person shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  }
]